public class ex001_Main {
    /*Метод main

    Чтобы наша программа заработала, метод main должен выглядеть в точности так:

    public static void main(String[] args)
    Вот значение ключевых слов, используемых в этом выражении. Для тех, кто только приступает к изучению программирования, нижеизложенное может показаться непонятным, в этом случае можно пока пропустить этот шаг.

    public - это модификатор доступа, означающий, что ограничений на доступ к данному методу нет. В каждом исходном файле может быть только один метод с модификатором public.

    static означает, что метод может работать без образования экземпляра класса. Например, если мы хотим посчитать высоту конкретного здания, то нам понадобится это здание (это и есть экземпляр класса), иначе будет нечего измерять. Если же требуется  вывести на печать фразу "Hello, World!", то ничего такого нам не потребуется.

    void означает, что метод ничего не возвращает в результате работы. Обратите внимание, что "не возвращает" не значит, что "не выводит" или "ничего не делает"!

    main - это имя нашего метода.

    Например, следующий код объявляет метод test, который ничего не возвращает и не имеет параметров:

    void test()
    Параметры метода объявляются в круглых скобках, следующих за именем метода.
    Для main это массив строк, называемых args. Мы будем использовать его в нашем следующем уроке, так что не волнуйтесь, если вы не понимаете всего этого сейчас.*/
}
